#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tThis move"}
$8 ~ "RB" && $5 ~ "^F[0-9]"  {print NR"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Previous move | This move |
|      24 | F61%          | RB        |
|      35 | F50%          | RB        |
|      47 | F61%          | RB        |
|      52 | F38%          | RB        |
|      65 | F61%          | RB        |
|      82 | F61%          | RB        |
|     102 | F61%          | RB        |
|     112 | F50%          | RB        |
|     115 | F50%          | RB        |
|     122 | F61%          | RB        |
|     125 | F50%          | RB        |

* HTF Move
#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tHTF move\tPrevious move\tThis move"}
$8 ~ "RB" && $5 ~ "^F[0-9]"  {print NR"\t"$3"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | HTF move | Previous move | This move |
|      24 | RB       | F61%          | RB        |
|      35 | RB       | F50%          | RB        |
|      47 | RB       | F61%          | RB        |
|      52 | F61%     | F38%          | RB        |
|      65 | RB/R     | F61%          | RB        |
|      82 | F61%     | F61%          | RB        |
|     102 | RB       | F61%          | RB        |
|     112 | HHHTF R  | F50%          | RB        |
|     115 | RB       | F50%          | RB        |
|     122 | HHHTF R  | F61%          | RB        |
|     125 | RB       | F50%          | RB        |
** Splits
#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tHTF move\tPrevious move\tThis move"}
$8 ~ "RB" && $5 ~ "^F[0-9]" && $3 ~ "F[0-9]" {print NR"\t"$3"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | HTF move | Previous move | This move |
|      52 | F61%     | F38%          | RB        |
|      82 | F61%     | F61%          | RB        |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tHTF move\tPrevious move\tThis move"}
$8 ~ "RB" && $5 ~ "^F[0-9]" && $3 ~ /\/R|R$|\w R|R\// {print NR"\t"$3"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | HTF move | Previous move | This move |
|      65 | RB/R     | F61%          | RB        |
|     112 | HHHTF R  | F50%          | RB        |
|     122 | HHHTF R  | F61%          | RB        |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tHTF move\tPrevious move\tThis move"}
$8 ~ "RB" && $5 ~ "^F[0-9]" && $3 ~ "RB" {print NR"\t"$3"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | HTF move | Previous move | This move |
|      24 | RB       | F61%          | RB        |
|      35 | RB       | F50%          | RB        |
|      47 | RB       | F61%          | RB        |
|      65 | RB/R     | F61%          | RB        |
|     102 | RB       | F61%          | RB        |
|     115 | RB       | F50%          | RB        |
|     125 | RB       | F50%          | RB        |
* Line previous move started at
#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tLine previous move started from\tThis move"}
$8 ~ "RB" && $5 ~ "^F[0-9]"  {print NR"\t"$5"\t"$6"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Previous move | Line previous move started from       | This move |
|      24 | F61%          | F61% at HTF F38%                      | RB        |
|      35 | F50%          | SS at HTF SS(mini move)               | RB        |
|      47 | F61%          | SS at HTF SS at HHTF SS at HHHTF F50% | RB        |
|      52 | F38%          | F38% at HTF F38% - synonymous moves   | RB        |
|      65 | F61%          | F61% at HTF F38% within HTF SS        | RB        |
|      82 | F61%          | F38%                                  | RB        |
|     102 | F61%          | HTF F61% at HTF RR                    | RB        |
|     112 | F50%          | F61%                                  | RB        |
|     115 | F50%          | SS at HTF SS                          | RB        |
|     122 | F61%          | RR at HTF F50%                        | RB        |
|     125 | F50%          | RR at HTF RR                          | RB        |
** Splits
#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tLine previous move started from\tThis move"}
$8 ~ "RB" && $5 ~ "^F[0-9]" && $6 ~ /^F[0-9].%/ {print NR"\t"$5"\t"$6"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Previous move | Line previous move started from     | This move |
|      24 | F61%          | F61% at HTF F38%                    | RB        |
|      52 | F38%          | F38% at HTF F38% - synonymous moves | RB        |
|      65 | F61%          | F61% at HTF F38% within HTF SS      | RB        |
|      82 | F61%          | F38%                                | RB        |
|     112 | F50%          | F61%                                | RB        |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tLine previous move started from\tThis move"}
$8 ~ "RB" && $5 ~ "^F[0-9]" && $6 ~ /^[SS|RR]/ {print NR"\t"$5"\t"$6"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Previous move | Line previous move started from       | This move |
|      35 | F50%          | SS at HTF SS(mini move)               | RB        |
|      47 | F61%          | SS at HTF SS at HHTF SS at HHHTF F50% | RB        |
|     115 | F50%          | SS at HTF SS                          | RB        |
|     122 | F61%          | RR at HTF F50%                        | RB        |
|     125 | F50%          | RR at HTF RR                          | RB        |
* Line This move started from
#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tThis move\tLine this move started from"}
$8 ~ "RB" && $5 ~ "^F[0-9]"  {print NR"\t"$5"\t"$8"\t"$9}
#+END_SRC
#+RESULTS:
| Move No | Previous move | This move | Line this move started from         |
|      24 | F61%          | RB        | F61%                                |
|      35 | F50%          | RB        | F50%                                |
|      47 | F61%          | RB        | F61% at HTF F61% - synonymous moves |
|      52 | F38%          | RB        | F38%                                |
|      65 | F61%          | RB        | F61% at HTF RR                      |
|      82 | F61%          | RB        | F61%                                |
|     102 | F61%          | RB        | F61% at HTF F61% - synonymous moves |
|     112 | F50%          | RB        | F50%                                |
|     115 | F50%          | RB        | F50% at HTF F50% - synonymous moves |
|     122 | F61%          | RB        | F61% at HTF F38%                    |
|     125 | F50%          | RB        | F38% at HTF F38% - synonymous moves |
** Splits
#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tThis move\tLine this move started from"}
$8 ~ "RB" && $5 ~ "^F[0-9]" && $9 ~ /^F[0-9].%$/ {print NR"\t"$5"\t"$8"\t"$9}
#+END_SRC
#+RESULTS:
| Move No | Previous move | This move | Line this move started from |
|      24 | F61%          | RB        | F61%                        |
|      35 | F50%          | RB        | F50%                        |
|      52 | F38%          | RB        | F38%                        |
|      82 | F61%          | RB        | F61%                        |
|     112 | F50%          | RB        | F50%                        |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tThis move\tLine this move started from"}
$8 ~ "RB" && $5 ~ "^F[0-9]" && $9 ~ "synonymous" {print NR"\t"$5"\t"$8"\t"$9}
#+END_SRC
#+RESULTS:
| Move No | Previous move | This move | Line this move started from         |
|      47 | F61%          | RB        | F61% at HTF F61% - synonymous moves |
|     102 | F61%          | RB        | F61% at HTF F61% - synonymous moves |
|     115 | F50%          | RB        | F50% at HTF F50% - synonymous moves |
|     125 | F50%          | RB        | F38% at HTF F38% - synonymous moves |
* Other starts that happened from F moves
#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tThis move"}
$5 ~ "^F[0-9][0-9]%$"   {print NR"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Previous move | This move  |
|      12 | F38%          | R          |
|      15 | F61%          | F61%       |
|      22 | F50%          | R/HTF F61% |
|      24 | F61%          | RB         |
|      32 | F61%          | F61%       |
|      33 | F61%          | F61%       |
|      35 | F50%          | RB         |
|      41 | F50%          | RB         |
|      47 | F61%          | RB         |
|      52 | F38%          | RB         |
|      55 | F61%          | R          |
|      60 | F50%          | R          |
|      65 | F61%          | RB         |
|      67 | F50%          | R          |
|      76 | F61%          | R          |
|      80 | F38%          | F61%       |
|      82 | F61%          | RB         |
|      85 | F61%          | R          |
|      92 | F50%          | R          |
|      96 | F50%          | R          |
|     102 | F61%          | RB         |
|     107 | F50%          | R          |
|     108 | F61%          | F50%       |
|     112 | F50%          | RB         |
|     115 | F50%          | RB         |
|     122 | F61%          | RB         |
|     125 | F50%          | RB         |
** Splits
Looking at the databse. Fib moves followed by fib moves are normally followed by RB moves 
Fibs are only reason opposite moves. I wonder where they start from. Also All the With move fib moves, they are interesting too.

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ "^F[0-9][0-9]%$"  {print NR"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Previous move | This move |
|      15 | F61%          | F61%      |
|      32 | F61%          | F61%      |
|      33 | F61%          | F61%      |
|      80 | F38%          | F61%      |
|     108 | F61%          | F50%      |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ /\/R|R$|\w R|R\//  {print NR"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Previous move | This move  |
|      12 | F38%          | R          |
|      22 | F50%          | R/HTF F61% |
|      55 | F61%          | R          |
|      60 | F50%          | R          |
|      67 | F50%          | R          |
|      76 | F61%          | R          |
|      85 | F61%          | R          |
|      92 | F50%          | R          |
|      96 | F50%          | R          |
|     107 | F50%          | R          |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ "RB"  {print NR"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Previous move | This move |
|      24 | F61%          | RB        |
|      35 | F50%          | RB        |
|      41 | F50%          | RB        |
|      47 | F61%          | RB        |
|      52 | F38%          | RB        |
|      65 | F61%          | RB        |
|      82 | F61%          | RB        |
|     102 | F61%          | RB        |
|     112 | F50%          | RB        |
|     115 | F50%          | RB        |
|     122 | F61%          | RB        |
|     125 | F50%          | RB        |
** HTF move the moves are in
#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tHTF move\tPrevious move\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ "^F[0-9][0-9]%$"  {print NR"\t"$3"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | HTF move | Previous move | This move |
|      15 | RB       | F61%          | F61%      |
|      32 | RB       | F61%          | F61%      |
|      33 | RB       | F61%          | F61%      |
|      80 | R        | F38%          | F61%      |
|     108 | HHHTF R  | F61%          | F50%      |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tHTF move\tPrevious move\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ /\/R|R$|\w R|R\//  {print NR"\t"$3"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | HTF move | Previous move | This move  |
|      12 | F61%     | F38%          | R          |
|      22 | F61%     | F50%          | R/HTF F61% |
|      55 | F61%     | F61%          | R          |
|      60 | RB       | F50%          | R          |
|      67 | RB/R     | F50%          | R          |
|      76 | RB       | F61%          | R          |
|      85 | HHHTF R  | F61%          | R          |
|      92 | RB       | F50%          | R          |
|      96 | RB       | F50%          | R          |
|     107 | F61%     | F50%          | R          |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tHTF move\tPrevious move\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ "RB"  {print NR"\t"$3"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | HTF move | Previous move | This move |
|      24 | RB       | F61%          | RB        |
|      35 | RB       | F50%          | RB        |
|      41 | R        | F50%          | RB        |
|      47 | RB       | F61%          | RB        |
|      52 | F61%     | F38%          | RB        |
|      65 | RB/R     | F61%          | RB        |
|      82 | F61%     | F61%          | RB        |
|     102 | RB       | F61%          | RB        |
|     112 | HHHTF R  | F50%          | RB        |
|     115 | RB       | F50%          | RB        |
|     122 | HHHTF R  | F61%          | RB        |
|     125 | RB       | F50%          | RB        |
** Direction in relation to HTF move
From what I can tell. Most moves that follow after a F move are WM meaning that the F moves peior to the current move is generally OM to the HTF move direction.

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tDirection in relation to HTF move\tPrevious move\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ "F[0-9]"  {print NR"\t"$4"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Direction in relation to HTF move | Previous move | This move  |
|      15 | WM                                | F61%          | F61%       |
|      22 | WM                                | F50%          | R/HTF F61% |
|      32 | OM                                | F61%          | F61%       |
|      80 | WM                                | F38%          | F61%       |
|     108 | WM                                | F61%          | F50%       |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tDirection in relation to HTF move\tPrevious move\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ /\/R|R$|\w R|R\//  {print NR"\t"$4"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Direction in relation to HTF move | Previous move | This move  |
|      12 | WM                                | F38%          | R          |
|      22 | WM                                | F50%          | R/HTF F61% |
|      55 | WM                                | F61%          | R          |
|      60 | OM                                | F50%          | R          |
|      67 | WM                                | F50%          | R          |
|      76 | WM                                | F61%          | R          |
|      85 | OM                                | F61%          | R          |
|      92 | WM                                | F50%          | R          |
|      96 | WM                                | F50%          | R          |
|     107 | OM                                | F50%          | R          |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tDirection in relation to HTF move\tPrevious move\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ "RB"  {print NR"\t"$4"\t"$5"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Direction in relation to HTF move | Previous move | This move |
|      24 | WM-FM                             | F61%          | RB        |
|      35 | WM                                | F50%          | RB        |
|      41 | WM                                | F50%          | RB        |
|      47 | WM                                | F61%          | RB        |
|      52 | OM                                | F38%          | RB        |
|      65 | WM-FM                             | F61%          | RB        |
|      82 | WM-FM                             | F61%          | RB        |
|     102 | WM-FM                             | F61%          | RB        |
|     112 | OM                                | F50%          | RB        |
|     115 | WM                                | F50%          | RB        |
|     122 | WM                                | F61%          | RB        |
|     125 | WM                                | F50%          | RB        |
** Line previous Fib started at

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tLine previous move started from\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ "^F[0-9][0-9]%$"  {print NR"\t"$5"\t"$6"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Previous move | Line previous move started from                                                      | This move |
|      15 | F61%          | RR within HHHHTF RR area. Possibly also be HHTF RR if considered as undershooting it | F61%      |
|      32 | F61%          | HTF F23%/RR                                                                          | F61%      |
|      80 | F38%          | HTF SS/HHTF SS                                                                       | F61%      |
|     108 | F61%          | HHTF F61%                                                                            | F50%      |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tLine previous move started from\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ /\/R|R$|\w R|R\//  {print NR"\t"$5"\t"$6"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Previous move | Line previous move started from | This move  |
|      12 | F38%          | HTF F38%/RR                     | R          |
|      22 | F50%          | HTF F61%/TTF resisatnce         | R/HTF F61% |
|      55 | F61%          | RR at HTF F61%                  | R          |
|      60 | F50%          | HTF resisatnce/HTF F61%         | R          |
|      67 | F50%          | HTF SS/SS                       | R          |
|      76 | F61%          | TTF resisatnce                  | R          |
|      85 | F61%          | HTF SS within HHTF SS           | R          |
|      92 | F50%          | RR                              | R          |
|      96 | F50%          | RR within HTF RR at HHTF F38%   | R          |
|     107 | F50%          | HTF F38%/F38%                   | R          |

#+BEGIN_SRC awk :in-file ~/Documents/price_database/08_10_2020.csv :exports results
BEGIN {FS=","
print "Move No\tPrevious move\tLine previous move started from\tThis move"}
$5 ~ "^F[0-9][0-9]%$" && $8 ~ "RB"  {print NR"\t"$5"\t"$6"\t"$8}
#+END_SRC
#+RESULTS:
| Move No | Previous move | Line previous move started from       | This move |
|      24 | F61%          | F61% at HTF F38%                      | RB        |
|      33 | F61%          | F61% within HTF SS(mini move)         | RB        |
|      35 | F50%          | SS at HTF SS(mini move)               | RB        |
|      41 | F50%          | RR at HTF F23% at HHTF F23%           | RB        |
|      47 | F61%          | SS at HTF SS at HHTF SS at HHHTF F50% | RB        |
|      52 | F38%          | F38% at HTF F38% - synonymous moves   | RB        |
|      65 | F61%          | F61% at HTF F38% within HTF SS        | RB        |
|      82 | F61%          | F38%                                  | RB        |
|     102 | F61%          | HTF F61% at HTF RR                    | RB        |
|     112 | F50%          | F61%                                  | RB        |
|     115 | F50%          | SS at HTF SS                          | RB        |
|     122 | F61%          | RR at HTF F50%                        | RB        |
|     125 | F50%          | RR at HTF RR                          | RB        |
